"""Машинное обучение (Machine Learning, ML) - это подраздел ИИ, который означает способность компьютерных систем
обучаться и делать прогнозы или принимать решения на основе данных, без явного программирования.

Основная идея машинного обучения заключается в том, что система может анализировать и извлекать закономерности из
большого объема данных, чтобы затем использовать эту информацию для принятия решений или выполнение задач."""

"""ДЛЯ ЧЕГО НУЖНО МАШИННОЕ ОБУЧЕНИЕ:
* Компьютерное зрение: распознавание объектов на изображениях, автоматическая классификация и аннотация изображений.
* Обработка текста и языка: машинный перевод, анализ тональности текста, генерации текста и другие задачи обработки
устественного языка (NLP, Natural Language Processing)
* Рекомендательные системы: предсказания интересов пользователей и рекомендации контента.
* Автономные транспортные средства: обработка данных с сенсоров для автоматического управления автомобилем.
* Медицинская диагностика: анализ медицинских изображений, диагностика заболеваний."""

"""ВИДЫ МАШИННОГО ОБУЧЕНИЯ
* Обучение с учителем: обучение происходит на известных данных. Например, по известным весу и росту определить пол
человека. Имеются данные с правильным входом и выходом. Задача: по входным параметрам сделать верное предсказание.
* Обучение без учителя: на входе имеются данные. Задача нейросети сделать на выходе кластеризацию (разбивку по группам).
Другими словами, найти какие-то общие закономерности у некоторых элементов на входе.
* Параметрическое обучение: характеризуется фиксированным набором стартовых параметров (например, коэффициенты (веса)
влияния веса и роста человека), регулируя которые можно добиваться лучшего результата. Например, берутся стартовые
значения параметров и с их помощью делается предсказание. Далее параметры немного подкручиваются, чтобы в следующий раз
быть ближе к правильному результату при тех же или похожих входных данных
* Непараметрическое обучение: количество паратетров определяется самой моделью в зависимости от входных данных

Параметрическое/непараметрическое обучение можно комбинировать с учителем/без учителя."""

"""Рисунок нейросети будет лежать в папке image под номером 1"""